# p 人のグループ A , q 人のグループ B , r 人のグループ C があります。
# 各グループのメンバーにはそれぞれ番号がつけられており、 
# A グループの i 番目の人は B グループの j 番目の人に仕事を任せ、 
# B グループの j 番目の人は与えられた仕事を C グループの k 番目の人に任せます。
# すると結局、 A グループの i 番目の人の仕事をするのは C グループの k 番目の人だということになります。

# パイザ君は A グループの各人の仕事を結局 C グループの誰が行うことになるのか知りたがっています。 
# A グループの人のそれぞれが最終的に C グループの誰に仕事を頼むことになるのかを、 
# A グループの人の番号が小さい順に p 行出力してください。


p, q, _ = gets.split(" ").map { |a| a.to_i }

pq = {}
(1..p).each do
  a, b = gets.split(" ").map { |a| a.to_i }
  pq[a] = b
end

qr = {}
(1..q).each do
  a, b = gets.split(" ").map { |a| a.to_i }
  qr[a] = b
end

(1..p).each do |i|
  printf("%d %d\n", i, qr[pq[i]])
end